let x = 6;
x /= 28;
/*
    x = x + 2; => x += 2
    x = x - 2; => x -= 2
    /= *= %=
    x = x ** 2; => x **= 2
*/
console.log(x);
console.log(x.toFixed(2) + 25);

/*
    Тип данных String (строка)
    Строка - это упорядоченная последовательность символов.
    'ESscript6' 
    "АБВ"
    'мама'
    `это - тожк строка! Она особенная`
    '' - это пустая строка
    " " - это не пустая строка
*/
console.log("\u270A");

/*
    Операторы для String
    + (сложение - конкатенация (concat - соединение))
*/
let name = "Михаил";
let food = "лимонад";
let age = "юного возраста ";

let phrase = age + name + " любит " + food;
phrase = name + "у " + "нравится " + food;

phrase = `${name = "Олег"} ${age}полюбил ${food}`;
console.log(phrase);

/*
Приведение типов данных 
Number -> String
    2 + "a" => "2" + "a" => "2a"
    2 + "5" => "2" + "5" => "25"
    "6" + 5 => "65"
    age + 5 => "65"
    age + "" => "12"
String -> Number 
    "12" * 2 => 24 (Любое арифметическое действие кроме сложения)
    x * 1 => 0.21
    +x => 0.21
*/
let a = 1, b = 2, c = 3, d = 4;

let result = ( a / c ** b ).toFixed(1) + d;
console.log(result);

console.log(name + ' говорит: \n\t\"Привет всем!\"');
/*
    \\ ==> "\"
    \" ==> '"'
    \n ==> "Enter"
    \r ==> Признак окончания строки
    \t ==> "Tab"
*/

